     A*%%TS  SD  19930105  160834  WIM         REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R DSP
     A*%%TS  SD  19930105  160834  WIM         REL-V2R2M0  5738-PW1
     A                                  3  2'sdfjslkdfjlsdf'
