     A*%%TS  SD  20160401  141931  WIM         REL-V6R1M0  5761-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R DSP
     A*%%TS  SD  20160401  141931  WIM         REL-V6R1M0  5761-WDS
     A                                  3  2'Hello World!! '
