     A          R R420R
     A            SRCSEQ         6S 2
     A            CHGC           1
     A            BLKC           1
     A            SRCDTA       114
     A            SRCKEY        80
     A            SEQORG         6S 2
     A            SRCDAT         6S
     A            SEQREF         6S 2
