     C/EXEC SQL
     C+ DROP TABLE OMSQL
     C/END-EXEC
     C/EXEC SQL
     C+ DROP TABLE OMAPP
     C/END-EXEC
      *
     c                   return
