     FDEMO      o    e             disk    rename(demor:ietsanders)
     Dlib              s             10a
     Dobj              s             10a
     C/EXEC SQL
     C+ CREATE PROCEDURE LIBENOBJ NOT DETERMINISTIC CONTAINS SQL EXTERNAL
     C+ PARAMETER STYLE GENERAL
     C/END-EXEC
      *
     c                   return
