     FNEWF01L1  IF   E           K DISK
     C                   READ      NEWF01L1                               96
     C                   EVAL      *INLR = *ON
